#include<stdio.h>
#include<math.h>
main(){
	int n,k;
	double F,P,i;
	printf("|-----------------------------------------|\n");
	printf("   请输入你所存入的本金：");
	scanf("%lf",&P);
	printf("|-----------------------------------------|\n");
	printf("   请输入你所存的年利率比：");
	scanf("%lf",&i);
	printf("|-----------------------------------------|\n");
    printf("   请输入你所存的年限：");
	scanf("%d",&n);
	printf("|-----------------------------------------|\n");
	printf("   请输入你所存的复利次数：");
	scanf("%d",&k);
	printf("|-----------------------------------------|\n");
	F=P*pow(i/k+1,k*n);
	printf("\n\n你所存款的复利终值为：%.4lf\n",F);
}

